; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	image0 - mode
	infrared2 - mode
	spectrograph1 - mode
	GroundStation3 - direction
	Star4 - direction
	Star0 - direction
	Star1 - direction
	Star2 - direction
	Planet5 - direction
	Star6 - direction
	Planet7 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Phenomenon10 - direction
	Planet11 - direction
	Phenomenon12 - direction
	Planet13 - direction
	Phenomenon14 - direction
	Star15 - direction
	Star16 - direction
	Star17 - direction
	Star18 - direction
)
(:init
	(supports instrument0 spectrograph1)
	(calibration_target instrument0 Star4)
	(supports instrument1 image0)
	(supports instrument1 spectrograph1)
	(calibration_target instrument1 Star4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star15)
	(supports instrument2 spectrograph1)
	(supports instrument2 infrared2)
	(supports instrument2 image0)
	(calibration_target instrument2 Star0)
	(supports instrument3 spectrograph1)
	(supports instrument3 infrared2)
	(supports instrument3 image0)
	(calibration_target instrument3 Star1)
	(supports instrument4 infrared2)
	(supports instrument4 image0)
	(supports instrument4 spectrograph1)
	(calibration_target instrument4 Star2)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon10)
)
(:goal (and
	(pointing satellite0 Planet8)
	(have_image Planet5 spectrograph1)
	(have_image Star6 infrared2)
	(have_image Planet7 image0)
	(have_image Planet8 image0)
	(have_image Phenomenon9 infrared2)
	(have_image Phenomenon10 infrared2)
	(have_image Planet11 infrared2)
	(have_image Phenomenon12 infrared2)
	(have_image Planet13 infrared2)
	(have_image Phenomenon14 infrared2)
	(have_image Star15 infrared2)
	(have_image Star16 spectrograph1)
	(have_image Star17 spectrograph1)
	(have_image Star18 infrared2)
))

)

; plan
1. (turn_to satellite1 star0 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 star0)
   goals met: 0 of 15
2. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 15
3. (calibrate satellite1 instrument2 star0)
   added: (calibrated instrument2)
   goals met: 0 of 15
4. (turn_to satellite1 phenomenon9 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 phenomenon9)
   goals met: 0 of 15
5. (take_image satellite1 phenomenon9 instrument2 infrared2)
   added: (have_image phenomenon9 infrared2)
   goals met: 1 of 15
6. (turn_to satellite1 phenomenon14 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 phenomenon14)
   goals met: 1 of 15
7. (take_image satellite1 phenomenon14 instrument2 infrared2)
   added: (have_image phenomenon14 infrared2)
   goals met: 2 of 15
8. (turn_to satellite1 phenomenon12 phenomenon14)
   deleted: (pointing satellite1 phenomenon14)
   added: (pointing satellite1 phenomenon12)
   goals met: 2 of 15
9. (take_image satellite1 phenomenon12 instrument2 infrared2)
   added: (have_image phenomenon12 infrared2)
   goals met: 3 of 15
10. (turn_to satellite1 phenomenon10 phenomenon12)
   deleted: (pointing satellite1 phenomenon12)
   added: (pointing satellite1 phenomenon10)
   goals met: 3 of 15
11. (take_image satellite1 phenomenon10 instrument2 infrared2)
   added: (have_image phenomenon10 infrared2)
   goals met: 4 of 15
12. (turn_to satellite0 planet8 star15)
   deleted: (pointing satellite0 star15)
   added: (pointing satellite0 planet8)
   goals met: 5 of 15
13. (turn_to satellite1 planet11 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 planet11)
   goals met: 5 of 15
14. (take_image satellite1 planet11 instrument2 infrared2)
   added: (have_image planet11 infrared2)
   goals met: 6 of 15
15. (turn_to satellite1 planet13 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 planet13)
   goals met: 6 of 15
16. (take_image satellite1 planet13 instrument2 infrared2)
   added: (have_image planet13 infrared2)
   goals met: 7 of 15
17. (turn_to satellite1 planet5 planet13)
   deleted: (pointing satellite1 planet13)
   added: (pointing satellite1 planet5)
   goals met: 7 of 15
18. (take_image satellite1 planet5 instrument2 spectrograph1)
   added: (have_image planet5 spectrograph1)
   goals met: 8 of 15
19. (turn_to satellite1 planet7 planet5)
   deleted: (pointing satellite1 planet5)
   added: (pointing satellite1 planet7)
   goals met: 8 of 15
20. (take_image satellite1 planet7 instrument2 image0)
   added: (have_image planet7 image0)
   goals met: 9 of 15
21. (turn_to satellite1 planet8 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 planet8)
   goals met: 9 of 15
22. (take_image satellite1 planet8 instrument2 image0)
   added: (have_image planet8 image0)
   goals met: 10 of 15
23. (turn_to satellite1 star15 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 star15)
   goals met: 10 of 15
24. (take_image satellite1 star15 instrument2 infrared2)
   added: (have_image star15 infrared2)
   goals met: 11 of 15
25. (turn_to satellite1 star16 star15)
   deleted: (pointing satellite1 star15)
   added: (pointing satellite1 star16)
   goals met: 11 of 15
26. (take_image satellite1 star16 instrument2 spectrograph1)
   added: (have_image star16 spectrograph1)
   goals met: 12 of 15
27. (turn_to satellite1 star17 star16)
   deleted: (pointing satellite1 star16)
   added: (pointing satellite1 star17)
   goals met: 12 of 15
28. (take_image satellite1 star17 instrument2 spectrograph1)
   added: (have_image star17 spectrograph1)
   goals met: 13 of 15
29. (turn_to satellite1 star18 star17)
   deleted: (pointing satellite1 star17)
   added: (pointing satellite1 star18)
   goals met: 13 of 15
30. (take_image satellite1 star18 instrument2 infrared2)
   added: (have_image star18 infrared2)
   goals met: 14 of 15
31. (turn_to satellite1 star6 star18)
   deleted: (pointing satellite1 star18)
   added: (pointing satellite1 star6)
   goals met: 14 of 15
32. (take_image satellite1 star6 instrument2 infrared2)
   added: (have_image star6 infrared2)
   goals met: 15 of 15
